Tutorials/Wall/constant/fluid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

flumeL    0.0;
plateL    5.0;
plateR    5.02;
flumeR    7.5;
front    0;
back    0.02;
bed    0.0;
waterL 0.26;
plateT  0.35;
flumeT   0.50;

firstY 66;
secondY 34;
thirdY 30;
leftX 370;
rightX 190;

vertices
(
   ($flumeL $front $bed)
   ($plateL $front $bed)
   ($plateL $front $waterL)
   ($flumeL $front $waterL)
   ($flumeL $front $plateT)
   ($plateL $front $plateT)
   ($plateL $front $flumeT)
   ($flumeL $front $flumeT)

   ($plateR $front $bed)
   ($flumeR $front $bed)
   ($flumeR $front $waterL)
   ($plateR $front $waterL)
   ($plateR $front $plateT)
   ($flumeR $front $plateT)
   ($flumeR $front $flumeT)
   ($plateR $front $flumeT)

   ($flumeL $back $bed) //16
   ($plateL $back $bed)
   ($plateL $back $waterL)
   ($flumeL $back $waterL)
   ($flumeL $back $plateT)
   ($plateL $back $plateT)
   ($plateL $back $flumeT)
   ($flumeL $back $flumeT)

   ($plateR $back $bed)
   ($flumeR $back $bed)
   ($flumeR $back $waterL)
   ($plateR $back $waterL)
   ($plateR $back $plateT)
   ($flumeR $back $plateT)
   ($flumeR $back $flumeT)
   ($plateR $back $flumeT)
);

blocks
(
    hex (0 1 17 16 3 2 18 19) ($leftX 1 $firstY) simpleGrading (1.0 1.0 0.5)
    hex (3 2 18 19 4 5 21 20) ($leftX 1 $secondY) simpleGrading (1.0 1.0 1)
    hex (4 5 21 20 7 6 22 23) ($leftX 1 $thirdY) simpleGrading (1.0 1.0 3.06)

    hex (5 12 28 21 6 15 31 22) (4 1 $thirdY) simpleGrading (1.0 1.0 3.06)

    hex (8 9 25 24 11 10 26 27) ($rightX 1 $firstY) simpleGrading (1.0 1.0 0.5)
    hex (11 10 26 27 12	13 29 28) ($rightX 1 $secondY) simpleGrading (1.0 1.0 1)
    hex (12 13 29 28 15	14 30 31) ($rightX 1 $thirdY) simpleGrading (1.0 1.0 3.06)
);

edges
(
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (0 3 19 16)
            (3 4 20 19)
            (4 7 23 20)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 10 26 25)
            (10 13 29 26)
            (13 14 30 29)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 17 16)
            (8 9 25 24)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (3 2 5 4)
            (4 5 6 7)
            (8 9 10 11)
            (11 10 13 12)
            (12 13 14 15)
            (5 12 15 6)

            (19 18 17 16)
            (20 21 18 19)
            (23 22 21 20)
            (27 26 25 24)
            (28 29 26 27)
            (31 30 29 28)
            (21 28 31 22)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (7 6 22 23)
            (6 15 31 22)
            (15 14 30 31)
        );
    }
    seawall
    {
        type patch;
        faces
        (
            (1 2 18 17)
            (2 5 21 18)
            (5 12 28 21)
            (12 11 27 28)
            (11 8 24 27)
        );
    }

);

mergePatchPairs
(
);

