Tutorials/Wall/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          130;
        startFace       145046;
    }
    outlet
    {
        type            patch;
        nFaces          130;
        startFace       145176;
    }
    bottom
    {
        type            wall;
        nFaces          560;
        startFace       145306;
    }
    frontAndBack
    {
        type            empty;
        nFaces          145840;
        startFace       145866;
    }
    atmosphere
    {
        type            patch;
        nFaces          564;
        startFace       291706;
    }
    seawall
    {
        type            patch;
        nFaces          204;
        startFace       292270;
    }
)


// ************************************************************************* //
