Tutorials/Wall/constant/fluid/waveDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        regular;

waveTheory      StokesV;

genAbs          1;

absDir          0.0;

nPaddles        1;

waveHeight      0.04;

wavePeriod      1.2;

waveDir         0.0;

// Parameters for setOla
setWaterLevel   0.3; // Still water level (Z, in m)
setWaterDepth   0.3; // Water depth to use in calculations (if irregular bottom)

// Change both entries to true to re-read this dictionary upon restart.
rereadAlpha     false;
rereadU         false;

// ************************************************************************* //
