Tutorials/Wall/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


plateL    5.0;
plateR    5.02;
front    0;
back    0.02;
bed    0.0;
waterL 0.26;
plateT  0.35;

vertices
(
   ($plateL $front $bed)
   ($plateR $front $bed)
   ($plateR $front $waterL)
   ($plateL $front $waterL)
   ($plateL $front $plateT)
   ($plateR $front $plateT)

   ($plateL $back $bed) //6
   ($plateR $back $bed)
   ($plateR $back $waterL)
   ($plateL $back $waterL)
   ($plateL $back $plateT)
   ($plateR $back $plateT)
);

blocks
(
    hex (0 1 7 6 3 2 8 9) (4 1 66) simpleGrading (1.0 1.0 0.5)
    hex (3 2 8 9 4 5 11 10) (4 1 34) simpleGrading (1.0 1.0 1)
);

edges
(
);

boundary
(
    seawall
    {
        type patch;
        faces
        (
            (0 3 9 6)
            (3 4 10 9)
            (4 5 11 10)
            (1 2 8 7)
            (2 5 11 8) 
        );
    }
    base
    {
        type patch;
        faces
        (
            (0 1 7 6)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (3 2 5 4)
            (9 8 7 6)
            (10 11 8 9)
        );
    }

);

mergePatchPairs
(
);

