Tutorials/Wall/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    seawall
    {
        type            patch;
        nFaces          204;
        startFace       696;
    }
    base
    {
        type            patch;
        nFaces          4;
        startFace       900;
    }
    frontAndBack
    {
        type            empty;
        nFaces          800;
        startFace       904;
    }
)


// ************************************************************************* //
